microhal/microhal/microhal/ports/stmCommon/registers/peripheralBaseAddressDefinitions/registersBaseAddressDefinitions_stm32h7x5_cm7.h
#ifndef _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32H7X5_CM7_H_
#define _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32H7X5_CM7_H_

#define _MICROHAL_COMP1_BASE_ADDRESS 0x58003800
#define _MICROHAL_CRS_BASE_ADDRESS 0x40008400
#define _MICROHAL_DAC_BASE_ADDRESS 0x40007400
#define _MICROHAL_BDMA_BASE_ADDRESS 0x58025400
#define _MICROHAL_DMA2D_BASE_ADDRESS 0x52001000
#define _MICROHAL_DMAMUX2_BASE_ADDRESS 0x58025800
#define _MICROHAL_FMC_BASE_ADDRESS 0x52004000
#define _MICROHAL_CEC_BASE_ADDRESS 0x40006C00
#define _MICROHAL_HSEM_BASE_ADDRESS 0x58026400
#define _MICROHAL_I2C1_BASE_ADDRESS 0x40005400
#define _MICROHAL_I2C2_BASE_ADDRESS 0x40005800
#define _MICROHAL_I2C3_BASE_ADDRESS 0x40005C00
#define _MICROHAL_I2C4_BASE_ADDRESS 0x58001C00
#define _MICROHAL_GPIOA_BASE_ADDRESS 0x58020000
#define _MICROHAL_GPIOB_BASE_ADDRESS 0x58020400
#define _MICROHAL_GPIOC_BASE_ADDRESS 0x58020800
#define _MICROHAL_GPIOD_BASE_ADDRESS 0x58020C00
#define _MICROHAL_GPIOE_BASE_ADDRESS 0x58021000
#define _MICROHAL_GPIOF_BASE_ADDRESS 0x58021400
#define _MICROHAL_GPIOG_BASE_ADDRESS 0x58021800
#define _MICROHAL_GPIOH_BASE_ADDRESS 0x58021C00
#define _MICROHAL_GPIOI_BASE_ADDRESS 0x58022000
#define _MICROHAL_GPIOJ_BASE_ADDRESS 0x58022400
#define _MICROHAL_GPIOK_BASE_ADDRESS 0x58022800
#define _MICROHAL_JPEG_BASE_ADDRESS 0x52003000
#define _MICROHAL_MDMA_BASE_ADDRESS 0x52000000
#define _MICROHAL_QUADSPI_BASE_ADDRESS 0x52005000
#define _MICROHAL_RNG_BASE_ADDRESS 0x48021800
#define _MICROHAL_RTC_BASE_ADDRESS 0x58004000
#define _MICROHAL_SAI4_BASE_ADDRESS 0x58005400
#define _MICROHAL_SAI1_BASE_ADDRESS 0x40015800
#define _MICROHAL_SAI2_BASE_ADDRESS 0x40015C00
#define _MICROHAL_SAI3_BASE_ADDRESS 0x40016000
#define _MICROHAL_SDMMC1_BASE_ADDRESS 0x52007000
#define _MICROHAL_SDMMC2_BASE_ADDRESS 0x48022400
#define _MICROHAL_VREFBUF_BASE_ADDRESS 0x58003C00
#define _MICROHAL_IWDG1_BASE_ADDRESS 0x58004800
#define _MICROHAL_IWDG2_BASE_ADDRESS 0x58004C00
#define _MICROHAL_WWDG1_BASE_ADDRESS 0x50003000
#define _MICROHAL_WWDG2_BASE_ADDRESS 0x40002C00
#define _MICROHAL_PWR_BASE_ADDRESS 0x58024800
#define _MICROHAL_SPI1_BASE_ADDRESS 0x40013000
#define _MICROHAL_SPI2_BASE_ADDRESS 0x40003800
#define _MICROHAL_SPI3_BASE_ADDRESS 0x40003C00
#define _MICROHAL_SPI4_BASE_ADDRESS 0x40013400
#define _MICROHAL_SPI5_BASE_ADDRESS 0x40015000
#define _MICROHAL_SPI6_BASE_ADDRESS 0x58001400
#define _MICROHAL_LTDC_BASE_ADDRESS 0x50001000
#define _MICROHAL_SPDIFRX_BASE_ADDRESS 0x40004000
#define _MICROHAL_ADC3_BASE_ADDRESS 0x58026000
#define _MICROHAL_ADC1_BASE_ADDRESS 0x40022000
#define _MICROHAL_ADC2_BASE_ADDRESS 0x40022100
#define _MICROHAL_ADC3_COMMON_BASE_ADDRESS 0x58026300
#define _MICROHAL_ADC12_COMMON_BASE_ADDRESS 0x40022300
#define _MICROHAL_DMAMUX1_BASE_ADDRESS 0x40020800
#define _MICROHAL_CRC_BASE_ADDRESS 0x58024C00
#define _MICROHAL_RCC_BASE_ADDRESS 0x58024400
#define _MICROHAL_LPTIM1_BASE_ADDRESS 0x40002400
#define _MICROHAL_LPTIM2_BASE_ADDRESS 0x58002400
#define _MICROHAL_LPTIM3_BASE_ADDRESS 0x58002800
#define _MICROHAL_LPTIM4_BASE_ADDRESS 0x58002C00
#define _MICROHAL_LPTIM5_BASE_ADDRESS 0x58003000
#define _MICROHAL_LPUART1_BASE_ADDRESS 0x58000C00
#define _MICROHAL_SYSCFG_BASE_ADDRESS 0x58000400
#define _MICROHAL_EXTI_BASE_ADDRESS 0x58000000
#define _MICROHAL_DELAY_BLOCK_SDMMC1_BASE_ADDRESS 0x52008000
#define _MICROHAL_DELAY_BLOCK_QUADSPI_BASE_ADDRESS 0x52006000
#define _MICROHAL_DELAY_BLOCK_SDMMC2_BASE_ADDRESS 0x48022800
#define _MICROHAL_FLASH_BASE_ADDRESS 0x52002000
#define _MICROHAL_AXI_BASE_ADDRESS 0x51000000
#define _MICROHAL_HASH_BASE_ADDRESS 0x48021400
#define _MICROHAL_CRYP_BASE_ADDRESS 0x48021000
#define _MICROHAL_DCMI_BASE_ADDRESS 0x48020000
#define _MICROHAL_OTG1_HS_GLOBAL_BASE_ADDRESS 0x40040000
#define _MICROHAL_OTG2_HS_GLOBAL_BASE_ADDRESS 0x40080000
#define _MICROHAL_OTG1_HS_HOST_BASE_ADDRESS 0x40040400
#define _MICROHAL_OTG2_HS_HOST_BASE_ADDRESS 0x40080400
#define _MICROHAL_OTG1_HS_DEVICE_BASE_ADDRESS 0x40040800
#define _MICROHAL_OTG2_HS_DEVICE_BASE_ADDRESS 0x40080800
#define _MICROHAL_OTG1_HS_PWRCLK_BASE_ADDRESS 0x40040E00
#define _MICROHAL_OTG2_HS_PWRCLK_BASE_ADDRESS 0x40080E00
#define _MICROHAL_ETHERNET_MAC_BASE_ADDRESS 0x40028000
#define _MICROHAL_DMA1_BASE_ADDRESS 0x40020000
#define _MICROHAL_DMA2_BASE_ADDRESS 0x40020400
#define _MICROHAL_HRTIM_MASTER_BASE_ADDRESS 0x40017400
#define _MICROHAL_HRTIM_TIMA_BASE_ADDRESS 0x40017480
#define _MICROHAL_HRTIM_TIMB_BASE_ADDRESS 0x40017500
#define _MICROHAL_HRTIM_TIMC_BASE_ADDRESS 0x40017580
#define _MICROHAL_HRTIM_TIMD_BASE_ADDRESS 0x40017600
#define _MICROHAL_HRTIM_TIME_BASE_ADDRESS 0x40017680
#define _MICROHAL_HRTIM_COMMON_BASE_ADDRESS 0x40017780
#define _MICROHAL_DFSDM_BASE_ADDRESS 0x40017000
#define _MICROHAL_TIM16_BASE_ADDRESS 0x40014400
#define _MICROHAL_TIM17_BASE_ADDRESS 0x40014800
#define _MICROHAL_TIM15_BASE_ADDRESS 0x40014000
#define _MICROHAL_USART1_BASE_ADDRESS 0x40011000
#define _MICROHAL_USART2_BASE_ADDRESS 0x40004400
#define _MICROHAL_USART3_BASE_ADDRESS 0x40004800
#define _MICROHAL_UART4_BASE_ADDRESS 0x40004C00
#define _MICROHAL_UART5_BASE_ADDRESS 0x40005000
#define _MICROHAL_USART6_BASE_ADDRESS 0x40011400
#define _MICROHAL_UART7_BASE_ADDRESS 0x40007800
#define _MICROHAL_UART8_BASE_ADDRESS 0x40007C00
#define _MICROHAL_TIM1_BASE_ADDRESS 0x40010000
#define _MICROHAL_TIM8_BASE_ADDRESS 0x40010400
#define _MICROHAL_FDCAN1_BASE_ADDRESS 0x4000A000
#define _MICROHAL_FDCAN2_BASE_ADDRESS 0x4000A400
#define _MICROHAL_CAN_CCU_BASE_ADDRESS 0x4000A800
#define _MICROHAL_MDIOS_BASE_ADDRESS 0x40009400
#define _MICROHAL_OPAMP_BASE_ADDRESS 0x40009000
#define _MICROHAL_SWPMI_BASE_ADDRESS 0x40008800
#define _MICROHAL_TIM2_BASE_ADDRESS 0x40000000
#define _MICROHAL_TIM3_BASE_ADDRESS 0x40000400
#define _MICROHAL_TIM4_BASE_ADDRESS 0x40000800
#define _MICROHAL_TIM5_BASE_ADDRESS 0x40000C00
#define _MICROHAL_TIM12_BASE_ADDRESS 0x40001800
#define _MICROHAL_TIM13_BASE_ADDRESS 0x40001C00
#define _MICROHAL_TIM14_BASE_ADDRESS 0x40002000
#define _MICROHAL_TIM6_BASE_ADDRESS 0x40001000
#define _MICROHAL_TIM7_BASE_ADDRESS 0x40001400
#define _MICROHAL_NVIC_BASE_ADDRESS 0xE000E100
#define _MICROHAL_MPU_BASE_ADDRESS 0xE000ED90
#define _MICROHAL_STK_BASE_ADDRESS 0xE000E010
#define _MICROHAL_NVIC_STIR_BASE_ADDRESS 0xE000EF00
#define _MICROHAL_FPU_CPACR_BASE_ADDRESS 0xE000ED88
#define _MICROHAL_SCB_ACTRL_BASE_ADDRESS 0xE000E008
#define _MICROHAL_FPU_BASE_ADDRESS 0xE000EF34
#define _MICROHAL_SCB_BASE_ADDRESS 0xE000ED00
#define _MICROHAL_PF_BASE_ADDRESS 0xE000ED78
#define _MICROHAL_AC_BASE_ADDRESS 0xE000EF90
#define _MICROHAL_RAMECC1_BASE_ADDRESS 0x52009000
#define _MICROHAL_RAMECC2_BASE_ADDRESS 0x48023000
#define _MICROHAL_RAMECC3_BASE_ADDRESS 0x58027000
#define _MICROHAL_ART_BASE_ADDRESS 0x40024400

#endif // _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32H7X5_CM7_H_
